<a href="https://colab.research.google.com/github/RemyLpr/defi_ia/blob/main/data/req_api.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Import des modules et des données

In [194]:
import urllib.parse
import requests
import numpy as np
import pandas as pd
import random
import string
import csv
from IPython.display import display
import io
from google.colab import files

In [111]:
df_test = pd.read_csv("test_set.csv")
coeffs_date = pd.read_csv("coeffs_date.csv")
coeffs_computer = pd.read_csv("coeffs_computer.csv")

# Initialisation session API

In [205]:
domain = "51.91.251.0"
port = 3000
host = f"http://{domain}:{port}"
path = lambda x: urllib.parse.urljoin(host, x)
user_id = 'e68dad03-0d1a-4038-8766-382b25fe4252'

# Requêtes restantes

In [211]:
r = requests.get(path(f"remaining-requests/{user_id}"))
print("Nombre de requêtes restantes :", r.json())

Nombre de requêtes restantes : 881

# Génération des paramètres

In [81]:
def params_generator(df_test, coeffs_date, coeffs_computer):
  # Pour city, répartition uniforme
  cities = df_test["city"].unique().tolist() # array par défaut
  city = random.choice(cities) # ville choisie
  # Pour date, suivre répartition fichier coeffs_date
  date = random.choices(coeffs_date["date"], coeffs_date["coeff"], k = 1)[0] # liste renvoyée, on prend premier terme car k = 1
  # Pour language, répartition uniforme également (choix par défaut)
  languages = df_test["language"].unique().tolist()
  language = random.choice(languages) # langue choisie
  # Pour mobile, répartition suivant le fichier coeffs_computer
  mobile_prob = coeffs_computer["computer"].tolist()[int(date)] # on sélectionne la proba que mobile = 0 correspondant à la date sélectionnée
  mobile_prob = [mobile_prob, 1 - mobile_prob]
  mobile = random.choices([0, 1], mobile_prob, k = 1)[0]
  # Pour l'instant on utilie un avatar par requête (temporaire)
  avatar = ''.join(random.choices(string.ascii_uppercase + string.digits, k=6)) # génération d'un pseudo aléatoire
  # Définition du dictionnaire des paramètres
  params = {"city" : city, "date" : date, "language" : language, "mobile" : mobile, "avatar_name" : avatar}
  return params

In [114]:
params = params_generator(df_test, coeffs_date, coeffs_computer)
params

{'city': 'amsterdam',
 'date': 22,
 'language': 'austrian',
 'mobile': 1,
 'avatar_name': '13B2YT'}

# Requêtage de l'API

**IMPORTANT** <br>
Avant de requêter il est nécessaire de pull la dernière version du fichier train_set.csv depuis le git et ensuite l'importer manuellement dans Colab. Une fois les requêtes effectuées il faut sauvegarder le fichier à l'emplacement local du git et push. Mettre un commentaire suivant le format : <br> prénom + nb_req total + date + heure

In [212]:
nb_req = int(input("Entrez le nombre de requêtes à exécuter "))
old_df = pd.read_csv("train_set.csv")
df = old_df.copy()
req_count = int(old_df["order_requests"].tolist()[-1]) # on récupère la dernière colonne (order_requests) de la dernière ligne
for i in range(1, nb_req + 1):
  params = params_generator(df_test, coeffs_date, coeffs_computer)
  requests.post(path(f'avatars/{user_id}/{params["avatar_name"]}')) # on doit indiquer à l'API qu'on crée ce nouvel avatar
  r = requests.get(path(f"pricing/{user_id}"), params = params)
  result = r.json() # résultat de la requête au format json
  query_res = pd.DataFrame(result['prices'])
  params_df = pd.DataFrame([result['request']]*len(query_res))
  new_df = pd.concat([query_res, params_df], axis=1)
  new_df["avatar_name"] = params["avatar_name"] # ajout du nom de l'avatar
  new_df["order_requests"] = req_count + i # ajout de la colonne order_requests comme dans le test_set
  # on ajoute les données extraites à notre dataset
  df = pd.concat([df, new_df])
  df.to_csv("train_set.csv", index=False) # pour pas écrire la colonne Unnamed : 0
print("Requêtage terminé !")

Entrez le nombre de requêtes à exécuter 500
Requêtage terminé !

In [220]:
data = pd.read_csv("train_set.csv")
data.drop(['Unnamed: 0'], axis=1, inplace=True)
data.to_csv("train_set.csv", index=False)

# Requêtage et enregistrement des résultats

In [ ]:
def save_data(result):

    query_res = pd.DataFrame(result['prices'])
    params = pd.DataFrame([result['request']]*len(query_res))
    df = pd.concat([query_res, params], axis=1)
    display(df)
    
    with open('train_set.csv', 'a') as f:
             df.to_csv(f, header=f.tell()==0, index=False)

In [ ]:
# params = {
#     "avatar_name": "nono10",
#     "language": "luxembourgish",
#     "city": "paris",
#     "date": 44,
#     "mobile": 1,
#     }
# r = requests.get(path(f"pricing/{user_id}"), params=params)

In [ ]:
# ATTENTION : n'exécuter qu'une et unique fois pour chaque requête sinon doublage dans les données !!
# save_df(r.json())

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         254    144    140  paris    44  luxembourgish       1     137635
1         722    145    141  paris    44  luxembourgish       1     137635
2         308    168    195  paris    44  luxembourgish       1     137635
3         782    243    276  paris    44  luxembourgish       1     137635
4         866    240    280  paris    44  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
162       595    141    140  paris    44  luxembourgish       1     137635
163       359    106    110  paris    44  luxembourgish       1     137635
164       199    171    197  paris    44  luxembourgish       1     137635
165       159    165    195  paris    44  luxembourgish       1     137635
166       942    164    198  paris    44  luxembourgish       1     137635

[167 rows x 8 columns]

## Essais

In [ ]:
# paris - luxembourgish - mobile = 1, avatar_name = nono10

# for req in range(43, -1, -1):
#     params = {
#     "avatar_name": "nono10",
#     "language": "luxembourgish",
#     "city": "paris",
#     "date": req,
#     "mobile": 1,
#     }
#     r = requests.get(path(f"pricing/{user_id}"), params=params)
    
#     save_df(r.json())

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         617    247    257  paris    43  luxembourgish       1     137635
1         130    166    184  paris    43  luxembourgish       1     137635
2         392    149    130  paris    43  luxembourgish       1     137635
3         229    174    186  paris    43  luxembourgish       1     137635
4         742    237    267  paris    43  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
162       825    147    132  paris    43  luxembourgish       1     137635
163       436    247    267  paris    43  luxembourgish       1     137635
164       782    254    256  paris    43  luxembourgish       1     137635
165        14    143    104  paris    43  luxembourgish       1     137635
166       663    149    133  paris    43  luxembourgish       1     137635

[167 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         579     80     50  paris    42  luxembourgish       1     137635
1         564     92     48  paris    42  luxembourgish       1     137635
2         614     83     49  paris    42  luxembourgish       1     137635
3          69    261    256  paris    42  luxembourgish       1     137635
4         379    258    251  paris    42  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
162       700    184    179  paris    42  luxembourgish       1     137635
163       477     80    124  paris    42  luxembourgish       1     137635
164       339    179    176  paris    42  luxembourgish       1     137635
165       577    152    122  paris    42  luxembourgish       1     137635
166       188     88     51  paris    42  luxembourgish       1     137635

[167 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         748    184    167  paris    41  luxembourgish       1     137635
1         447    111     90  paris    41  luxembourgish       1     137635
2         842    267    216  paris    41  luxembourgish       1     137635
3         299    106    118  paris    41  luxembourgish       1     137635
4         767    154    110  paris    41  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
162       602    111     48  paris    41  luxembourgish       1     137635
163       182    159    118  paris    41  luxembourgish       1     137635
164       301    109     93  paris    41  luxembourgish       1     137635
165       306    188    156  paris    41  luxembourgish       1     137635
166       207    157    116  paris    41  luxembourgish       1     137635

[167 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         741    156    107  paris    40  luxembourgish       1     137635
1         580    117     84  paris    40  luxembourgish       1     137635
2         868    179    157  paris    40  luxembourgish       1     137635
3         866    263    225  paris    40  luxembourgish       1     137635
4         656    111     89  paris    40  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
153       576    195    146  paris    40  luxembourgish       1     137635
154        24    256    233  paris    40  luxembourgish       1     137635
155       612    179    155  paris    40  luxembourgish       1     137635
156       492    115     88  paris    40  luxembourgish       1     137635
157       808    254    211  paris    40  luxembourgish       1     137635

[158 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         631     85     41  paris    39  luxembourgish       1     137635
1         534    263    218  paris    39  luxembourgish       1     137635
2         314    112     79  paris    39  luxembourgish       1     137635
3         182    160    109  paris    39  luxembourgish       1     137635
4         842    280    186  paris    39  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
153       634     86     41  paris    39  luxembourgish       1     137635
154       467    256    198  paris    39  luxembourgish       1     137635
155       274    157    106  paris    39  luxembourgish       1     137635
156       926    181    144  paris    39  luxembourgish       1     137635
157       560    153    102  paris    39  luxembourgish       1     137635

[158 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         851     86     81  paris    38  luxembourgish       1     137635
1         323    271    191  paris    38  luxembourgish       1     137635
2         842    290    172  paris    38  luxembourgish       1     137635
3         612    186    135  paris    38  luxembourgish       1     137635
4           0    181    133  paris    38  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       564     96     38  paris    38  luxembourgish       1     137635
152       782    278    192  paris    38  luxembourgish       1     137635
153       579     84     40  paris    38  luxembourgish       1     137635
154       645    159     94  paris    38  luxembourgish       1     137635
155       467    268    187  paris    38  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         148    118     69  paris    37  luxembourgish       1     137635
1         731    162     88  paris    37  luxembourgish       1     137635
2         756    192    120  paris    37  luxembourgish       1     137635
3          49    165     95  paris    37  luxembourgish       1     137635
4         121     82     40  paris    37  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       540    275    186  paris    37  luxembourgish       1     137635
152       571    263    180  paris    37  luxembourgish       1     137635
153        41    117     68  paris    37  luxembourgish       1     137635
154       882    191    125  paris    37  luxembourgish       1     137635
155       132    259    182  paris    37  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         216    194    118  paris    36  luxembourgish       1     137635
1         182    160     96  paris    36  luxembourgish       1     137635
2         741    170     80  paris    36  luxembourgish       1     137635
3         948    194    120  paris    36  luxembourgish       1     137635
4         837    254    175  paris    36  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       165    159     91  paris    36  luxembourgish       1     137635
152       359    122     64  paris    36  luxembourgish       1     137635
153       645    165     82  paris    36  luxembourgish       1     137635
154        14    158     72  paris    36  luxembourgish       1     137635
155       227     85     34  paris    36  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         225    165     74  paris    35  luxembourgish       1     137635
1         397    278    156  paris    35  luxembourgish       1     137635
2         640    160     70  paris    35  luxembourgish       1     137635
3         582    197    111  paris    35  luxembourgish       1     137635
4         926    181    113  paris    35  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       595    154     84  paris    35  luxembourgish       1     137635
152       825    169     80  paris    35  luxembourgish       1     137635
153       207    172     81  paris    35  luxembourgish       1     137635
154       159    182    116  paris    35  luxembourgish       1     137635
155       663    156     84  paris    35  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         946    195     97  paris    34  luxembourgish       1     137635
1         910     88     33  paris    34  luxembourgish       1     137635
2         756    200     95  paris    34  luxembourgish       1     137635
3         948    194    106  paris    34  luxembourgish       1     137635
4          62     80     32  paris    34  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       767    169     70  paris    34  luxembourgish       1     137635
152       259    123     48  paris    34  luxembourgish       1     137635
153       130    191     97  paris    34  luxembourgish       1     137635
154       949    284    143  paris    34  luxembourgish       1     137635
155       227     85     30  paris    34  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         133    166     66  paris    33  luxembourgish       1     137635
1         963    117     60  paris    33  luxembourgish       1     137635
2         121     82     33  paris    33  luxembourgish       1     137635
3         731    176     66  paris    33  luxembourgish       1     137635
4         741    178     66  paris    33  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       342    119     31  paris    33  luxembourgish       1     137635
161       972     83     27  paris    33  luxembourgish       1     137635
162       447    111     56  paris    33  luxembourgish       1     137635
163       192    120     30  paris    33  luxembourgish       1     137635
164       227     85     29  paris    33  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         327    212     80  paris    32  luxembourgish       1     137635
1         700    186    124  paris    32  luxembourgish       1     137635
2         254    165     68  paris    32  luxembourgish       1     137635
3         540    287    126  paris    32  luxembourgish       1     137635
4          29    200     91  paris    32  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       392    170     72  paris    32  luxembourgish       1     137635
161       782    278    148  paris    32  luxembourgish       1     137635
162       176     90     16  paris    32  luxembourgish       1     137635
163       436    259    165  paris    32  luxembourgish       1     137635
164       299    119     58  paris    32  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         970    265    137  paris    31  luxembourgish       1     137635
1         421    125     47  paris    31  luxembourgish       1     137635
2         509     93     20  paris    31  luxembourgish       1     137635
3         182    160     68  paris    31  luxembourgish       1     137635
4         188     89     30  paris    31  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       132    271    124  paris    31  luxembourgish       1     137635
161       560    161     64  paris    31  luxembourgish       1     137635
162        49    165     75  paris    31  luxembourgish       1     137635
163       338    206     78  paris    31  luxembourgish       1     137635
164       863    263    131  paris    31  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         803    298    104  paris    30  luxembourgish       1     137635
1         397    278    100  paris    30  luxembourgish       1     137635
2         963    117     51  paris    30  luxembourgish       1     137635
3         436    259    151  paris    30  luxembourgish       1     137635
4         797    120     50  paris    30  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160        56    209     71  paris    30  luxembourgish       1     137635
161       986    194     75  paris    30  luxembourgish       1     137635
162       338    206     74  paris    30  luxembourgish       1     137635
163       540    287    107  paris    30  luxembourgish       1     137635
164       579     84     26  paris    30  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         980    120     40  paris    29  luxembourgish       1     137635
1          41    122     37  paris    29  luxembourgish       1     137635
2         331     92     37  paris    29  luxembourgish       1     137635
3         723     82     20  paris    29  luxembourgish       1     137635
4         580    127     34  paris    29  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       858    199     68  paris    29  luxembourgish       1     137635
161       314    123     36  paris    29  luxembourgish       1     137635
162       338    206     70  paris    29  luxembourgish       1     137635
163       889    157     49  paris    29  luxembourgish       1     137635
164       700    186    115  paris    29  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         823    197     64  paris    28  luxembourgish       1     137635
1         159    199     62  paris    28  luxembourgish       1     137635
2           0    188     76  paris    28  luxembourgish       1     137635
3         522    119     40  paris    28  luxembourgish       1     137635
4          62     87     20  paris    28  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       306    197     60  paris    28  luxembourgish       1     137635
161       327    221     57  paris    28  luxembourgish       1     137635
162       663    163     52  paris    28  luxembourgish       1     137635
163       540    300     88  paris    28  luxembourgish       1     137635
164       882    199     62  paris    28  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         795    174     34  paris    27  luxembourgish       1     137635
1         306    206     56  paris    27  luxembourgish       1     137635
2         797    125     38  paris    27  luxembourgish       1     137635
3         980    120     34  paris    27  luxembourgish       1     137635
4          21     85     21  paris    27  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160        62     87     18  paris    27  luxembourgish       1     137635
161       584    290     85  paris    27  luxembourgish       1     137635
162       722    166     38  paris    27  luxembourgish       1     137635
163       115    112     52  paris    27  luxembourgish       1     137635
164       785    212     47  paris    27  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         123    117     28  paris    26  luxembourgish       1     137635
1         397    303     69  paris    26  luxembourgish       1     137635
2         792     89     39  paris    26  luxembourgish       1     137635
3         573    313     88  paris    26  luxembourgish       1     137635
4         165    169     46  paris    26  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       882    199     50  paris    26  luxembourgish       1     137635
161       767    169     42  paris    26  luxembourgish       1     137635
162       963    117     41  paris    26  luxembourgish       1     137635
163       946    203     52  paris    26  luxembourgish       1     137635
164       912    172      0  paris    26  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         582    214     50  paris    25  luxembourgish       1     137635
1         123    117     26  paris    25  luxembourgish       1     137635
2         785    212     38  paris    25  luxembourgish       1     137635
3         912    172      0  paris    25  luxembourgish       1     137635
4         972     90     12  paris    25  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       133    166     18  paris    25  luxembourgish       1     137635
161       705    150     24  paris    25  luxembourgish       1     137635
162       889    172     36  paris    25  luxembourgish       1     137635
163       949    296     71  paris    25  luxembourgish       1     137635
164       357    169     36  paris    25  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         975    174     38  paris    24  luxembourgish       1     137635
1         782    278     89  paris    24  luxembourgish       1     137635
2         980    120     26  paris    24  luxembourgish       1     137635
3         534    312     51  paris    24  luxembourgish       1     137635
4         741    184     30  paris    24  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       992     87     10  paris    24  luxembourgish       1     137635
161       748    184     74  paris    24  luxembourgish       1     137635
162       797    131     28  paris    24  luxembourgish       1     137635
163       868    187     53  paris    24  luxembourgish       1     137635
164       986    202     43  paris    24  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         254    172     30  paris    23  luxembourgish       1     137635
1         949    296     59  paris    23  luxembourgish       1     137635
2          95    298     59  paris    23  luxembourgish       1     137635
3         580    133     19  paris    23  luxembourgish       1     137635
4         841     91     25  paris    23  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       306    206     43  paris    23  luxembourgish       1     137635
161       797    131     26  paris    23  luxembourgish       1     137635
162       229    199     35  paris    23  luxembourgish       1     137635
163       722    181     24  paris    23  luxembourgish       1     137635
164       975    174     35  paris    23  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0          56    209     41  paris    22  luxembourgish       1     137635
1         564     96      0  paris    22  luxembourgish       1     137635
2         584    303     50  paris    22  luxembourgish       1     137635
3         731    197     24  paris    22  luxembourgish       1     137635
4         736    194     41  paris    22  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       580    137     18  paris    22  luxembourgish       1     137635
161       248    197     41  paris    22  luxembourgish       1     137635
162       975    174     33  paris    22  luxembourgish       1     137635
163       884    200     35  paris    22  luxembourgish       1     137635
164       176     90      0  paris    22  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         705    150     18  paris    21  luxembourgish       1     137635
1         949    296     45  paris    21  luxembourgish       1     137635
2         817    214     35  paris    21  luxembourgish       1     137635
3         851     89     23  paris    21  luxembourgish       1     137635
4         150    203     36  paris    21  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       342    121     12  paris    21  luxembourgish       1     137635
152       477     88     26  paris    21  luxembourgish       1     137635
153       792     89     30  paris    21  luxembourgish       1     137635
154        24    256     65  paris    21  luxembourgish       1     137635
155       911    118     24  paris    21  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         790    310     42  paris    20  luxembourgish       1     137635
1         115    112     40  paris    20  luxembourgish       1     137635
2         992     87      3  paris    20  luxembourgish       1     137635
3         946    212     29  paris    20  luxembourgish       1     137635
4         723     90      9  paris    20  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151        21     90     11  paris    20  luxembourgish       1     137635
152       858    224     24  paris    20  luxembourgish       1     137635
153        95    321     40  paris    20  luxembourgish       1     137635
154        41    137     16  paris    20  luxembourgish       1     137635
155       484    145     16  paris    20  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         576    238     24  paris    19  luxembourgish       1     137635
1         238    167      2  paris    19  luxembourgish       1     137635
2         564     96      0  paris    19  luxembourgish       1     137635
3         165    169     30  paris    19  luxembourgish       1     137635
4          69    265    109  paris    19  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       986    227     24  paris    19  luxembourgish       1     137635
152       492    123      0  paris    19  luxembourgish       1     137635
153       842    383     28  paris    19  luxembourgish       1     137635
154       150    212     30  paris    19  luxembourgish       1     137635
155       412    278    108  paris    19  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         540    312     42  paris    18  luxembourgish       1     137635
1         584    340     30  paris    18  luxembourgish       1     137635
2         419    122     18  paris    18  luxembourgish       1     137635
3         741    199     18  paris    18  luxembourgish       1     137635
4         492    123      0  paris    18  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       782    278     57  paris    18  luxembourgish       1     137635
152       708    169     20  paris    18  luxembourgish       1     137635
153       573    313     47  paris    18  luxembourgish       1     137635
154       614     92      0  paris    18  luxembourgish       1     137635
155       975    174     26  paris    18  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         808    369     23  paris    17  luxembourgish       1     137635
1         684     85      8  paris    17  luxembourgish       1     137635
2         415    133     14  paris    17  luxembourgish       1     137635
3         736    202     23  paris    17  luxembourgish       1     137635
4         738    129     16  paris    17  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       863    312     27  paris    17  luxembourgish       1     137635
152        21     90      7  paris    17  luxembourgish       1     137635
153       823    222     18  paris    17  luxembourgish       1     137635
154       851     93     15  paris    17  luxembourgish       1     137635
155       948    202     27  paris    17  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         640    202     14  paris    16  luxembourgish       1     137635
1         182    170     12  paris    16  luxembourgish       1     137635
2         115    112     35  paris    16  luxembourgish       1     137635
3         327    238     17  paris    16  luxembourgish       1     137635
4         274    200     14  paris    16  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       986    227     17  paris    16  luxembourgish       1     137635
152       792     89     22  paris    16  luxembourgish       1     137635
153       863    312     22  paris    16  luxembourgish       1     137635
154       314    123      0  paris    16  luxembourgish       1     137635
155       436    259     82  paris    16  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0          14    158     19  paris    15  luxembourgish       1     137635
1         970    311     29  paris    15  luxembourgish       1     137635
2         331    103     12  paris    15  luxembourgish       1     137635
3          27    263     46  paris    15  luxembourgish       1     137635
4         580    148     12  paris    15  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
151       602    121      7  paris    15  luxembourgish       1     137635
152       972    105      6  paris    15  luxembourgish       1     137635
153       119    240     14  paris    15  luxembourgish       1     137635
154       738    129     13  paris    15  luxembourgish       1     137635
155       188     89     17  paris    15  luxembourgish       1     137635

[156 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         776    167      0  paris    14  luxembourgish       1     137635
1         631     87      0  paris    14  luxembourgish       1     137635
2         823    262     12  paris    14  luxembourgish       1     137635
3          29    275     12  paris    14  luxembourgish       1     137635
4         123    132      9  paris    14  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160        28    167      8  paris    14  luxembourgish       1     137635
161         0    230     19  paris    14  luxembourgish       1     137635
162        69    265     92  paris    14  luxembourgish       1     137635
163       866    395     17  paris    14  luxembourgish       1     137635
164       656    127     10  paris    14  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         412    278     90  paris    13  luxembourgish       1     137635
1         795    174      0  paris    13  luxembourgish       1     137635
2         868    244     11  paris    13  luxembourgish       1     137635
3         415    133     10  paris    13  luxembourgish       1     137635
4         645    169      0  paris    13  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       640    202     10  paris    13  luxembourgish       1     137635
161       946    272     11  paris    13  luxembourgish       1     137635
162       602    121      5  paris    13  luxembourgish       1     137635
163       797    152      8  paris    13  luxembourgish       1     137635
164       188     89     15  paris    13  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         992     87      0  paris    12  luxembourgish       1     137635
1         863    383     13  paris    12  luxembourgish       1     137635
2         949    331     20  paris    12  luxembourgish       1     137635
3         986    270     10  paris    12  luxembourgish       1     137635
4         910     90      7  paris    12  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       634     91      0  paris    12  luxembourgish       1     137635
161       165    169     20  paris    12  luxembourgish       1     137635
162       148    120      0  paris    12  luxembourgish       1     137635
163       942    271     12  paris    12  luxembourgish       1     137635
164       308    253     13  paris    12  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         705    150      2  paris    11  luxembourgish       1     137635
1         946    272      8  paris    11  luxembourgish       1     137635
2          62     90      0  paris    11  luxembourgish       1     137635
3         617    389     19  paris    11  luxembourgish       1     137635
4         748    200     15  paris    11  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       742    307     15  paris    11  luxembourgish       1     137635
161        66    195     10  paris    11  luxembourgish       1     137635
162       889    200     10  paris    11  luxembourgish       1     137635
163       972    105      5  paris    11  luxembourgish       1     137635
164       741    199     11  paris    11  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         119    266      7  paris    10  luxembourgish       1     137635
1          94    262     66  paris    10  luxembourgish       1     137635
2         379    369     18  paris    10  luxembourgish       1     137635
3         579     89      0  paris    10  luxembourgish       1     137635
4         882    232      0  paris    10  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       305    202     10  paris    10  luxembourgish       1     137635
161       415    153      6  paris    10  luxembourgish       1     137635
162       290    200     10  paris    10  luxembourgish       1     137635
163        29    334      7  paris    10  luxembourgish       1     137635
164       795    174      0  paris    10  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         133    166      0  paris     9  luxembourgish       1     137635
1         522    206      4  paris     9  luxembourgish       1     137635
2          65    169      0  paris     9  luxembourgish       1     137635
3         998    236      0  paris     9  luxembourgish       1     137635
4         851     93      1  paris     9  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       176     90      0  paris     9  luxembourgish       1     137635
161       339    266     12  paris     9  luxembourgish       1     137635
162       132    353     14  paris     9  luxembourgish       1     137635
163       238    167      0  paris     9  luxembourgish       1     137635
164       573    361     16  paris     9  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         795    174      0  paris     8  luxembourgish       1     137635
1         972    105      5  paris     8  luxembourgish       1     137635
2          66    195      7  paris     8  luxembourgish       1     137635
3         182    170      0  paris     8  luxembourgish       1     137635
4         392    199      2  paris     8  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       474    192      8  paris     8  luxembourgish       1     137635
161       884    233     10  paris     8  luxembourgish       1     137635
162       571    479      7  paris     8  luxembourgish       1     137635
163       132    411     12  paris     8  luxembourgish       1     137635
164       584    484      8  paris     8  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         165    169     12  paris     7  luxembourgish       1     137635
1         290    200      6  paris     7  luxembourgish       1     137635
2         359    148      5  paris     7  luxembourgish       1     137635
3          17     86      4  paris     7  luxembourgish       1     137635
4          29    334      5  paris     7  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
160       216    253      8  paris     7  luxembourgish       1     137635
161       858    315      5  paris     7  luxembourgish       1     137635
162       975    174     10  paris     7  luxembourgish       1     137635
163       564     96      0  paris     7  luxembourgish       1     137635
164       412    278     75  paris     7  luxembourgish       1     137635

[165 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         741    199      6  paris     6  luxembourgish       1     137635
1         910     92      0  paris     6  luxembourgish       1     137635
2         182    170      0  paris     6  luxembourgish       1     137635
3         447    142      1  paris     6  luxembourgish       1     137635
4         731    197      0  paris     6  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
150       926    197     15  paris     6  luxembourgish       1     137635
151       748    275      6  paris     6  luxembourgish       1     137635
152       792     89      8  paris     6  luxembourgish       1     137635
153       248    329      4  paris     6  luxembourgish       1     137635
154        66    195      5  paris     6  luxembourgish       1     137635

[155 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         785    298      4  paris     5  luxembourgish       1     137635
1         797    152      0  paris     5  luxembourgish       1     137635
2         474    192      4  paris     5  luxembourgish       1     137635
3         229    232      7  paris     5  luxembourgish       1     137635
4         853    197      5  paris     5  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
150        14    164      0  paris     5  luxembourgish       1     137635
151       342    126      0  paris     5  luxembourgish       1     137635
152       447    142      0  paris     5  luxembourgish       1     137635
153        41    142      4  paris     5  luxembourgish       1     137635
154       159    331      4  paris     5  luxembourgish       1     137635

[155 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         986    337      3  paris     4  luxembourgish       1     137635
1         975    174      6  paris     4  luxembourgish       1     137635
2         937    295      3  paris     4  luxembourgish       1     137635
3         910     92      0  paris     4  luxembourgish       1     137635
4          21     90      0  paris     4  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
150       176     90      0  paris     4  luxembourgish       1     137635
151       130    331      3  paris     4  luxembourgish       1     137635
152       992     87      0  paris     4  luxembourgish       1     137635
153       225    200      2  paris     4  luxembourgish       1     137635
154       436    259     27  paris     4  luxembourgish       1     137635

[155 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         238    167      0  paris     3  luxembourgish       1     137635
1         776    167      0  paris     3  luxembourgish       1     137635
2         577    197      0  paris     3  luxembourgish       1     137635
3         656    157      1  paris     3  luxembourgish       1     137635
4         338    206     15  paris     3  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
150       121     87      0  paris     3  luxembourgish       1     137635
151       986    337      2  paris     3  luxembourgish       1     137635
152       222    357      4  paris     3  luxembourgish       1     137635
153       484    145      2  paris     3  luxembourgish       1     137635
154       534    335      3  paris     3  luxembourgish       1     137635

[155 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         290    184      2  paris     2  luxembourgish       1     137635
1         817    317      1  paris     2  luxembourgish       1     137635
2         631     87      0  paris     2  luxembourgish       1     137635
3         306    238      3  paris     2  luxembourgish       1     137635
4         640    202      0  paris     2  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
150       229    214      3  paris     2  luxembourgish       1     137635
151       123    163      1  paris     2  luxembourgish       1     137635
152       558    107      0  paris     2  luxembourgish       1     137635
153       723     90      0  paris     2  luxembourgish       1     137635
154       412    256     65  paris     2  luxembourgish       1     137635

[155 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         314    123      0  paris     1  luxembourgish       1     137635
1         735    203      0  paris     1  luxembourgish       1     137635
2         342    126      0  paris     1  luxembourgish       1     137635
3         301    128      1  paris     1  luxembourgish       1     137635
4         614     92      0  paris     1  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
150       397    448      1  paris     1  luxembourgish       1     137635
151        29    334      1  paris     1  luxembourgish       1     137635
152       576    238      0  paris     1  luxembourgish       1     137635
153       612    219      1  paris     1  luxembourgish       1     137635
154       327    238      0  paris     1  luxembourgish       1     137635

[155 rows x 8 columns]

     hotel_id  price  stock   city  date       language  mobile  avatar_id
0         884    233      0  paris     0  luxembourgish       1     137635
1         584    484      0  paris     0  luxembourgish       1     137635
2         645    169      0  paris     0  luxembourgish       1     137635
3         182    170      0  paris     0  luxembourgish       1     137635
4         290    200      0  paris     0  luxembourgish       1     137635
..        ...    ...    ...    ...   ...            ...     ...        ...
150       948    312      0  paris     0  luxembourgish       1     137635
151       647    150      0  paris     0  luxembourgish       1     137635
152       782    388      0  paris     0  luxembourgish       1     137635
153       631     87      0  paris     0  luxembourgish       1     137635
154       492    123      0  paris     0  luxembourgish       1     137635

[155 rows x 8 columns]

In [ ]:
req = pd.read_csv('train_set.csv')
req

      hotel_id  price  stock   city  date       language  mobile  avatar_id
0          254    144    140  paris    44  luxembourgish       1     137635
1          722    145    141  paris    44  luxembourgish       1     137635
2          308    168    195  paris    44  luxembourgish       1     137635
3          782    243    276  paris    44  luxembourgish       1     137635
4          866    240    280  paris    44  luxembourgish       1     137635
...        ...    ...    ...    ...   ...            ...     ...        ...
7236       948    312      0  paris     0  luxembourgish       1     137635
7237       647    150      0  paris     0  luxembourgish       1     137635
7238       782    388      0  paris     0  luxembourgish       1     137635
7239       631     87      0  paris     0  luxembourgish       1     137635
7240       492    123      0  paris     0  luxembourgish       1     137635

[7241 rows x 8 columns]